routes/web.php

select count(*) as aggregate from `subscriptions` where `user_id` = 17
select * from `users`
select * from `plans`
select * from `bookings` where `user_id` = 17 order by `id` asc limit 10 offset 0
select count(*) as aggregate from `bookings` where `user_id` = 17
---
    Route::post('subscription', [PlanController::class, 'subscribe'])->name("subscription.create");

    Route::get('/users/subscription', function () {
    return view('user.subscription.index', [
        'subscriptions' => Subscription::where('user_id', auth()->user()->id)->orderBy('id', 'ASC')->paginate(10),
        'users' => User::all(),
        'plans' => Plan::all()
    ]);
    });

    Route::get('/users/booking', function () {
    return view('user.booking.index', [
        'bookings' => Booking::where('user_id', auth()->user()->id)->orderBy('id', 'ASC')->paginate(10),
        'users' => User::all(),
        // 'plans' => Plan::all()
    ]);