app/Http/Controllers/BookingController.php

    public function index()
    {
        return view('admin.booking.index', [
            'bookings' => Booking::orderBy('id', 'ASC')->paginate(10)
        ]);
---
select * from `bookings` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `bookings`

    public function store(Request $request)
    {
        // dd($request->all());
        $validated = $request->validate([

            // 'user_id' => 'required|exists:users,id',
            'name' => 'required|string|max:255',
            'email' => 'required|email',
            'mobile' => 'required|regex:/^([0-9\s\-\+\(\)]*)$/|min:10',
            'gender' => 'required|string|max:10',
            'date' => 'required|date',
            'time' => 'required',
            'status' => 'required|string|max:255',

        ]);

        // $validated = $request->all();

        Booking::create($validated);
---
insert into `bookings` (`name`, `user_id`, `email`, `status`, `mobile`, `gender`, `date`, `time`, `updated_at`, `created_at`) values ('Test user', '12', 'user@gmail.com', '0', '0761606445', 'mm', '06/05/2024', '3:36 PM', '2024-06-05 10:07:09', '2024-06-05 10:07:09')