app/Http/Controllers/DashboardController.php

    public function dashboard()
    {
        // Prepare data for each month of the current year
        $months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec'];

        $usersData = $this->getMonthlyUsersData();
        $customersData = $this->getMonthlyCustomersData();
        $subscriptionData = $this->getSubscriptionData();
        $salesData = $this->getMonthlySalesData();
        $totalUsers = User::count(); // Get the total number of users
        $totalSales = $this->getTotalSalesForYear();
        $totalCustomers = DB::table('subscription_items')->distinct('id')->count(); // Total number of customers
---
select count(*) as aggregate from `users`
select count(distinct `id`) as aggregate from `subscription_items`

    private function getMonthlyUsersData()
    {
        $usersData = [];

        for ($month = 1; $month <= 12; $month++) {
            $startDate = Carbon::create(null, $month)->startOfMonth();
            $endDate = Carbon::create(null, $month)->endOfMonth();

            $usersCount = User::whereBetween('created_at', [$startDate, $endDate])->count();
---
select count(*) as aggregate from `users` where `created_at` between '2024-01-01 00:00:00' and '2024-01-31 23:59:59'

    private function getMonthlyCustomersData()
    {
        $customersData = [];

        for ($month = 1; $month <= 12; $month++) {
            $startDate = Carbon::create(null, $month)->startOfMonth();
            $endDate = Carbon::create(null, $month)->endOfMonth();

            $customersCount = DB::table('subscription_items')
                ->select('user_id')
                ->distinct()
                ->whereBetween('created_at', [$startDate, $endDate])
                ->count();
---
select count(*) as aggregate from `subscription_items` where `created_at` between '2024-01-01 00:00:00' and '2024-01-31 23:59:59'

    private function getSubscriptionData()
    {
        $basicPlanCount = DB::table('subscription_items')
            ->where('stripe_price', 'price_1PJTO7JncBMXlWz2ZX32QJMG')
            ->count();
        $standardPlanCount = DB::table('subscription_items')
            ->where('stripe_price', 'price_1PJTPKJncBMXlWz2y0ZkBgeH')
            ->count();
        $premiumPlanCount = DB::table('subscription_items')
            ->where('stripe_price', 'price_1PJTQFJncBMXlWz2SEsZtgdB')
            ->count();
---
select count(*) as aggregate from `subscription_items` where `stripe_price` = 'price_1PJTQFJncBMXlWz2SEsZtgdB'

    private function getMonthlySalesData()
    {
        $salesData = [];
        $priceMapping = [
            'price_1PJTO7JncBMXlWz2ZX32QJMG' => 20, // basic plan
            'price_1PJTPKJncBMXlWz2y0ZkBgeH' => 40, // standard plan
            'price_1PJTQFJncBMXlWz2SEsZtgdB' => 70  // premium plan
        ];

        for ($month = 1; $month <= 12; $month++) {
            $startDate = Carbon::create(null, $month)->startOfMonth();
            $endDate = Carbon::create(null, $month)->endOfMonth();

            $monthlySales = DB::table('subscription_items')
                ->whereBetween('created_at', [$startDate, $endDate])
                ->get()
                ->reduce(function ($total, $item) use ($priceMapping) {
                    return $total + ($priceMapping[$item->stripe_price] ?? 0);
                }, 0);
---
select * from `subscription_items` where `created_at` between '2024-01-01 00:00:00' and '2024-01-31 23:59:59'

    private function getTotalSalesForYear()
    {
        $startOfYear = Carbon::now()->startOfYear();
        $endOfYear = Carbon::now()->endOfYear();

        $priceMapping = [
            'price_1PJTO7JncBMXlWz2ZX32QJMG' => 20, // basic plan
            'price_1PJTPKJncBMXlWz2y0ZkBgeH' => 40, // standard plan
            'price_1PJTQFJncBMXlWz2SEsZtgdB' => 70  // premium plan
        ];

        $totalSales = DB::table('subscription_items')
            ->whereBetween('created_at', [$startOfYear, $endOfYear])
            ->get()
            ->reduce(function ($total, $item) use ($priceMapping) {
                return $total + ($priceMapping[$item->stripe_price] ?? 0);
            }, 0);
---
select * from `subscription_items` where `created_at` between '2024-01-01 00:00:00' and '2024-12-31 23:59:59'