app/Http/Controllers/DashboardController.php

    public function dashboard()
    {
        // Start and end dates for the current month
        $startDate = Carbon::now()->startOfMonth();
        $endDate = Carbon::now()->endOfMonth();

        // Fetching data
        $users = User::whereBetween('created_at', [$startDate, $endDate])->get();
        $customers = DB::table('subscription_items')
            ->select('user_id')
            ->distinct()
            ->whereBetween('created_at', [$startDate, $endDate])
            ->count();
        $subscriptionItems = DB::table('subscription_items')
            ->whereBetween('created_at', [$startDate, $endDate])
            ->get();
---
select * from `users` where `created_at` between '2024-06-01 00:00:00' and '2024-06-30 23:59:59'
select * from `subscription_items` where `created_at` between '2024-06-01 00:00:00' and '2024-06-30 23:59:59'

            $usersData[] = $users->where('created_at', '>=', $currentDate->startOfDay())
                                 ->where('created_at', '<=', $currentDate->endOfDay())
                                 ->count();
            $customersData[] = DB::table('subscription_items')
                ->select('user_id')
                ->distinct()
                ->whereBetween('created_at', [$currentDate->startOfDay(), $currentDate->endOfDay()])
                ->count();
---
select count(*) as aggregate from `subscription_items` where `created_at` between '2024-06-01 23:59:59' and '2024-06-01 23:59:59'