app/Http/Controllers/ProductController.php

select * from `products`
---
    public function store(StoreProductRequest $request)
    {
        (new Product())->create($request->all());