app/Http/Controllers/StockController.php

select * from `stocks` where `stocks`.`deleted_at` is null order by `id` asc limit 10 offset 0
select count(*) as aggregate from `stocks` where `stocks`.`deleted_at` is null
select * from `products`
---
    public function index()
    {
        return view('admin.stock.index', [
            'stock' => Stock::orderBy('id', 'ASC')->paginate(10),
            'products' => Product::all()
        ]);