app/Http/Controllers/SubscriptionController.php

    public function index()
    {
        return view('admin.subscription.index', [
            'subscriptions' => Subscription::orderBy('id', 'ASC')->paginate(10),
            'users' => User::all(),
            'plans' => Plan::all()
        ]);
---
select * from `subscriptions` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `subscriptions`
select * from `users`
select * from `plans`